Documents/ЗакрытиеЗаказовНаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗакрытиеЗаказовНаПроизводство</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостояниеЗаказов</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полуфабрикат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брак</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаПроизводство</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗакрытиеЗаказовНаПроизводство/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыПроведенияДокумента

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
//Процедура СформироватьСостояниеЗаказов(ДокументСсылка, СтруктураДополнительныеСвойства)
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ВременнаяТаблицаЗаказы.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
//		|	ВременнаяТаблицаШапка.Организация КАК Организация,
//		|	ВременнаяТаблицаШапка.Дата КАК Период,
//		|	ВременнаяТаблицаЗаказы.Продукция КАК Продукция
//		|ИЗ
//		|	ВременнаяТаблицаЗаказы КАК ВременнаяТаблицаЗаказы
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
//		|		ПО (ИСТИНА)";
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостояниеЗаказов", РезультатЗапроса.Выгрузить());
//КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Дата,
		|	ТаблицаДокумента.Организация
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.ЗакрытиеЗаказовНаПроизводство КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗакрытиеЗаказовНаПроизводствоЗаказы.ЗаказНаПроизводство,
		|	ЗакрытиеЗаказовНаПроизводствоЗаказы.Продукция,
		|	ЗакрытиеЗаказовНаПроизводствоЗаказы.Количество
		|ПОМЕСТИТЬ ВременнаяТаблицаЗаказы
		|ИЗ
		|	Документ.ЗакрытиеЗаказовНаПроизводство.Заказы КАК ЗакрытиеЗаказовНаПроизводствоЗаказы
		|ГДЕ
		|	ЗакрытиеЗаказовНаПроизводствоЗаказы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Выполнить();
	
	//СформироватьСостояниеЗаказов(ДокументСсылка, СтруктураДополнительныеСвойства);
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает заголовок документа для печатной формы.
//
// Параметры:
//  Шапка - любая структура с полями:
//           Номер         - Строка или Число - номер документа;
//           Дата          - Дата - дата документа;
//           Представление - Строка - (необязательный) платформенное представление ссылки на документ.
//                                    Если параметр НазваниеДокумента не задан, то название документа будет вычисляться
//                                    из этого параметра.
//  НазваниеДокумента - Строка - название документа (например, "Счет на оплату").
//
// Возвращаемое значение:
//  Строка - заголовок документа.
//
Функция СформироватьЗаголовокДокумента(Шапка, Знач НазваниеДокумента = "") Экспорт
	
	ДанныеДокумента = Новый Структура("Номер,Дата,Представление");
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, Шапка);
	
	// Если название документа не передано, получим название по представлению документа.
	Если ПустаяСтрока(НазваниеДокумента) И ЗначениеЗаполнено(ДанныеДокумента.Представление) Тогда
		ПоложениеНомера = СтрНайти(ДанныеДокумента.Представление, ДанныеДокумента.Номер);
		Если ПоложениеНомера > 0 Тогда
			НазваниеДокумента = СокрЛП(Лев(ДанныеДокумента.Представление, ПоложениеНомера - 1));
		КонецЕсли;
	КонецЕсли;

	НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ДанныеДокумента.Номер);
	Возврат СтрШаблон(НСтр("ru = '%1 № %2 от %3'"),
		НазваниеДокумента, НомерНаПечать, Формат(ДанныеДокумента.Дата, "ДЛФ=DD"));
	
КонецФункции

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

//Функция ПечатьАктаСписания(МассивОбъектов, ОбъектыПечати)
//	
//	ТекстЗапроса = 
//		"ВЫБРАТЬ
//		|	ТаблицаДокумента.Ссылка,
//		|	ТаблицаДокумента.Номер,
//		|	ТаблицаДокумента.Дата,
//		|	ТаблицаДокумента.Дата КАК ДатаДокумента,
//		|	ТаблицаДокумента.Организация,
//		|	ТаблицаДокумента.Комментарий,
//		|	ТаблицаДокумента.Комиссия.(
//		|		Ссылка,
//		|		ФизЛицо,
//		|		Председатель,
//		|		ФизЛицо.Наименование
//		|	),
//		|	ТаблицаДокумента.Спецодежда.(
//		|		Ссылка,
//		|		НомерСтроки,
//		|		Номенклатура.Код КАК Код,
//		|		Номенклатура,
//		|		Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
//		|		Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
//		|		ПРЕДСТАВЛЕНИЕ(ТаблицаДокумента.Спецодежда.Номенклатура.ЕдиницаИзмерения) КАК ЕдИзмПредставление,
//		|		Количество,
//		|		Цена,
//		|		Сумма,
//		|		ДатаВыдачи
//		|	)
//		|ИЗ
//		|	Документ.СписаниеСпецодеждыДосрочное КАК ТаблицаДокумента
//		|ГДЕ
//		|	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";	
//	Запрос = Новый Запрос(ТекстЗапроса);	
//	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	
//	Шапка = Запрос.Выполнить().Выбрать();
//	
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	ТабличныйДокумент.КлючПараметровПечати = "СписаниеСпецодеждыДосрочное_АктСписания";
//	
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СписаниеСпецодеждыДосрочное.ПФ_MXL_АктСписания");
//	
//	Пока Шапка.Следующий() Цикл
//		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
//			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//		КонецЕсли;
//		
//		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
//		
//		// Подготовка данных
//		ДанныеПечати = Новый Структура;
//		
//		ДанныеПечати.Вставить("ДатаДокумента", Шапка.ДатаДокумента);
//		ДанныеПечати.Вставить("ТекстЗаголовка", СформироватьЗаголовокДокумента(Шапка, НСтр("ru = 'Акт списания'")));
//		
//		ТекстПодЗаголовка = НСтр("ru = 'Мы, нижеподписавшиеся,'");
//		ВыборкаКомиссия = Шапка.Комиссия.Выбрать();
//		Пока ВыборкаКомиссия.Следующий() Цикл
//			ДанныеФизЛица = БухгалтерскийУчетСервер.ДанныеФизЛица(Шапка.Организация, ВыборкаКомиссия.ФизЛицо, Шапка.ДатаДокумента);
//			ТекстПодЗаголовка = ТекстПодЗаголовка 
//				+ ?(ЗначениеЗаполнено(ДанныеФизЛица.Должность), ДанныеФизЛица.Должность, "")
//				+ " " + ДанныеФизЛица.Представление + ", ";
//		КонецЦикла;
//		ТекстПодЗаголовка = ТекстПодЗаголовка + Символы.ПС + НСтр("ru = 'составили настоящий акт о том, что, '") + СокрЛП(Шапка.Комментарий);

//		ДанныеПечати.Вставить("ТекстПодЗаголовка", ТекстПодЗаголовка);
//		
//		ВременнаяТаблицаСпецодежда = Шапка.Спецодежда.Выгрузить();
//		ДанныеПечати.Вставить("Всего", ВременнаяТаблицаСпецодежда.Итог("Сумма"));
//		ДанныеПечати.Вставить("ИтоговаяСтрока", 
//			СтрШаблон(НСтр("ru = 'Всего наименований %1, на сумму %2'"), 
//			Формат(ВременнаяТаблицаСпецодежда.Количество(), "ЧН=0; ЧГ=0"), 
//			Формат(ДанныеПечати.Всего, "ЧЦ=15; ЧДЦ=2")));
//		ДанныеПечати.Вставить("СуммаПрописью", БухгалтерскийУчетСервер.СформироватьСуммуПрописью(ДанныеПечати.Всего));
//		
//		// Инициализация массива областей макета
//		МассивОбластейМакета = Новый Массив;
//		МассивОбластейМакета.Добавить("Заголовок");
//		МассивОбластейМакета.Добавить("ШапкаТаблицы");
//		МассивОбластейМакета.Добавить("Строка");
//		МассивОбластейМакета.Добавить("ИтогиТаблицы");
//		МассивОбластейМакета.Добавить("СуммаПрописью");
//		МассивОбластейМакета.Добавить("Подвал");
//		МассивОбластейМакета.Добавить("ПодписиКомиссия");
//		
//		Для Каждого ИмяОбласти Из МассивОбластейМакета Цикл
//			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
//			Если ИмяОбласти <> "Строка"
//				И ИмяОбласти <> "ПодписиКомиссия" Тогда
//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
//				ТабличныйДокумент.Вывести(ОбластьМакета);
//			ИначеЕсли ИмяОбласти = "Строка" Тогда 
//				Для Каждого СтрокаТаблицы Из ВременнаяТаблицаСпецодежда Цикл
//					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
//					ТабличныйДокумент.Вывести(ОбластьМакета);
//				КонецЦикла;
//			ИначеЕсли ИмяОбласти = "ПодписиКомиссия" Тогда
//				// Формирование комиссии
//				ВыборкаКомиссия = Шапка.Комиссия.Выбрать();
//				Пока ВыборкаКомиссия.Следующий() Цикл
//					ОбластьМакета.Параметры.Заполнить(ВыборкаКомиссия);
//					
//					ДанныеФизЛица = БухгалтерскийУчетСервер.ДанныеФизЛица(Шапка.Организация, ВыборкаКомиссия.ФизЛицо, Шапка.ДатаДокумента);
//					ОбластьМакета.Параметры.Должность 			= ДанныеФизЛица.Должность;
//					ОбластьМакета.Параметры.РасшифровкаПодписи	= ДанныеФизЛица.Представление;						
//					
//					ТабличныйДокумент.Вывести(ОбластьМакета);
//				КонецЦикла;
//			КонецЕсли;	
//		КонецЦикла;
//		
//		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
//	КонецЦикла;
//	
//	Возврат ТабличныйДокумент;
//	
//КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСписания") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
	//	"АктСписания", 
	//	"Акт списания", 
	//	ПечатьАктаСписания(МассивОбъектов, ОбъектыПечати),
	//	,
	//	"Документ.СписаниеСпецодеждыДосрочное.ПФ_MXL_АктСписания");
	//КонецЕсли;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "АктСписания";
	//КомандаПечати.Представление = НСтр("ru = 'Акт списания'");
	//КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.Порядок = 1;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
